Revit 2027 API
DimensionType.GetEqualityFormula Method
 Gets an ordered list of the entries in the equality formula definition.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public IList<DimensionEqualityLabelFormatting> GetEqualityFormula()
Public Function GetEqualityFormula As IList(Of DimensionEqualityLabelFormatting)
public:
IList<DimensionEqualityLabelFormatting^>^ GetEqualityFormula()
member GetEqualityFormula : unit -> IList<DimensionEqualityLabelFormatting>
Return Value
IList<DimensionEqualityLabelFormatting>
 An ordered list of the entries in the equality formula definition.
Exceptions
Exception | Condition
InvalidOperationException |  The given DimensionType cannot be assigned an equality formula as it is not continuous linear or angular.
See Also
Reference
DimensionType Class
Autodesk.Revit.DB Namespace